## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be created
  + resource "aws_ecs_service" "pomerium_sso_proxy" {
      + cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "pomerium_sso_proxy"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }
      + task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:8"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "pomerium_sso_proxy"
          + container_port   = 443
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-00ab298fa807e1a6b",
            ]
          + subnets          = [
              + "subnet-02f9faab35fe00ab5",
              + "subnet-0385f9edcaed377a6",
              + "subnet-0bcec438eb3211fae",
            ]
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ca-central-1:794722365809:certificate/fd72956c-0bf0-4fae-91e4-372e5e0ef85f"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:loadbalancer/app/pomerium-sso/a3cb73cfad1e6ac8"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2020-10"
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener_certificate.https_sni will be created
  + resource "aws_lb_listener_certificate" "https_sni" {
      + certificate_arn = "arn:aws:acm:ca-central-1:794722365809:certificate/fd72956c-0bf0-4fae-91e4-372e5e0ef85f"
      + id              = (known after apply)
      + listener_arn    = (known after apply)
    }

  # aws_lb_target_group.ecs will be destroyed
  # (because aws_lb_target_group.ecs is not in configuration)
  - resource "aws_lb_target_group" "ecs" {
      - arn                                = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> null
      - arn_suffix                         = "targetgroup/ecs/d4e6ecaa0c5ed62b" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "ecs" -> null
      - port                               = 443 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09a32d3e2e932fa09" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - matcher             = "200-399" -> null
          - path                = "/ping" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 10 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # aws_lb_target_group.sso_proxy must be replaced
-/+ resource "aws_lb_target_group" "sso_proxy" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/ecs/d4e6ecaa0c5ed62b" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "ecs" -> "sso-proxy" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)


      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
